Kyalivia/Conncted-Car-Controller/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define D6_1602_Pin GPIO_PIN_10
#define D6_1602_GPIO_Port GPIOB
#define FAN1_Pin GPIO_PIN_13
#define FAN1_GPIO_Port GPIOB
#define FAN2_Pin GPIO_PIN_14
#define FAN2_GPIO_Port GPIOB
#define FAN3_Pin GPIO_PIN_15
#define FAN3_GPIO_Port GPIOB
#define RS_1602_Pin GPIO_PIN_7
#define RS_1602_GPIO_Port GPIOC
#define D7_1602_Pin GPIO_PIN_8
#define D7_1602_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define D5_1602_Pin GPIO_PIN_4
#define D5_1602_GPIO_Port GPIOB
#define D4_1602_Pin GPIO_PIN_5
#define D4_1602_GPIO_Port GPIOB
#define EN_1602_Pin GPIO_PIN_6
#define EN_1602_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
